const expect = require('chai').expect;
const { convert } = require('../');

describe('Convert', function () {
    describe('Success cases', function () {
        [
            [1, 'واحد'],
            [12, 'اثنا عشر'],
            [24, 'أربع و عشرون'],
            [164, 'مئة و أربع وستون'],
            [1245, 'ألف و مئتان و خمس وأربعون'],
            [84958, 'أربع و ثمانون ألف و تسع مئة و ثمان وخمسون'],
            [456295, 'أربع مئة و ست وخمسون ألف و مئتان و خمس وتسعون'],
            [1983758, 'مليون و تسع مئة و ثلاث وثمانون ألف و سبع مئة و ثمان وخمسون'],
            [86752985, 'ست و ثمانون مليون و سبع مئة و اثنان وخمسون ألف و تسع مئة و خمس وثمانون'],
            [938506748, 'تسع مئة و ثمان وثلاثون مليون و خمس مئة و ست ألف و سبع مئة و ثمان وأربعون'],

            ['123456789123', ' مئة و ثلاث وعشرون بليون و أربع مئة و ست وخمسون مليون و سبع مئة و تسع وثمانون ألف و مئة و ثلاث وعشرون '],
            ['123456789123123', ' مئة و ثلاث وعشرون تريليون و أربع مئة و ست وخمسون بليون و سبع مئة و تسع وثمانون مليون و مئة و ثلاث وعشرون ألف و مئة و ثلاث وعشرون '],
            ['123456789123123876', ' مئة و ثلاث وعشرون كوادريليون و أربع مئة و ست وخمسون تريليون و سبع مئة و تسع وثمانون بليون و مئة و ثلاث وعشرون مليون و مئة و ثلاث وعشرون ألف و ثمان مئة و ست وسبعون '],
            ['123456789123123876983', ' مئة و ثلاث وعشرون كوينتليون و أربع مئة و ست وخمسون كوادريليون و سبع مئة و تسع وثمانون تريليون و مئة و ثلاث وعشرون بليون و مئة و ثلاث وعشرون مليون و ثمان مئة و ست وسبعون ألف و تسع مئة و ثلاث وثمانون '],
            ['123456789123123876983273', ' مئة و ثلاث وعشرون سكستليون و أربع مئة و ست وخمسون كوينتليون و سبع مئة و تسع وثمانون كوادريليون و مئة و ثلاث وعشرون تريليون و مئة و ثلاث وعشرون بليون و ثمان مئة و ست وسبعون مليون و تسع مئة و ثلاث وثمانون ألف و مئتان و ثلاث وسبعون '],
            ['123456789123123876983273829', ' مئة و ثلاث وعشرون سبتيلليون و أربع مئة و ست وخمسون سكستليون و سبع مئة و تسع وثمانون كوينتليون و مئة و ثلاث وعشرون كوادريليون و مئة و ثلاث وعشرون تريليون و ثمان مئة و ست وسبعون بليون و تسع مئة و ثلاث وثمانون مليون و مئتان و ثلاث وسبعون ألف و ثمان مئة و تسع وعشرون '],
            ['123456789123123876983273829492', ' مئة و ثلاث وعشرون أوكتيليون و أربع مئة و ست وخمسون سبتيلليون و سبع مئة و تسع وثمانون سكستليون و مئة و ثلاث وعشرون كوينتليون و مئة و ثلاث وعشرون كوادريليون و ثمان مئة و ست وسبعون تريليون و تسع مئة و ثلاث وثمانون بليون و مئتان و ثلاث وسبعون مليون و ثمان مئة و تسع وعشرون ألف و أربع مئة و اثنان وتسعون '],
            ['123456789123123876983273829492284', ' مئة و ثلاث وعشرون نونيلليون و أربع مئة و ست وخمسون أوكتيليون و سبع مئة و تسع وثمانون سبتيلليون و مئة و ثلاث وعشرون سكستليون و مئة و ثلاث وعشرون كوينتليون و ثمان مئة و ست وسبعون كوادريليون و تسع مئة و ثلاث وثمانون تريليون و مئتان و ثلاث وسبعون بليون و ثمان مئة و تسع وعشرون مليون و أربع مئة و اثنان وتسعون ألف و مئتان و أربع وثمانون '],
            ['123456789123123876983273829492283504', ' مئة و ثلاث وعشرون دشيليون و أربع مئة و ست وخمسون نونيلليون و سبع مئة و تسع وثمانون أوكتيليون و مئة و ثلاث وعشرون سبتيلليون و مئة و ثلاث وعشرون سكستليون و ثمان مئة و ست وسبعون كوينتليون و تسع مئة و ثلاث وثمانون كوادريليون و مئتان و ثلاث وسبعون تريليون و ثمان مئة و تسع وعشرون بليون و أربع مئة و اثنان وتسعون مليون و مئتان و ثلاث وثمانون ألف و خمس مئة و أربع '],
            ['123456789123123876983273829492283504036', ' مئة و ثلاث وعشرون أوندشيلليون و أربع مئة و ست وخمسون دشيليون و سبع مئة و تسع وثمانون نونيلليون و مئة و ثلاث وعشرون أوكتيليون و مئة و ثلاث وعشرون سبتيلليون و ثمان مئة و ست وسبعون سكستليون و تسع مئة و ثلاث وثمانون كوينتليون و مئتان و ثلاث وسبعون كوادريليون و ثمان مئة و تسع وعشرون تريليون و أربع مئة و اثنان وتسعون بليون و مئتان و ثلاث وثمانون مليون و خمس مئة و أربع ألف و ست و ثلاثون '],
            ['123456789123123876983273829492283504036547', ' مئة و ثلاث وعشرون دودشيليون و أربع مئة و ست وخمسون أوندشيلليون و سبع مئة و تسع وثمانون دشيليون و مئة و ثلاث وعشرون نونيلليون و مئة و ثلاث وعشرون أوكتيليون و ثمان مئة و ست وسبعون سبتيلليون و تسع مئة و ثلاث وثمانون سكستليون و مئتان و ثلاث وسبعون كوينتليون و ثمان مئة و تسع وعشرون كوادريليون و أربع مئة و اثنان وتسعون تريليون و مئتان و ثلاث وثمانون بليون و خمس مئة و أربع مليون و ست و ثلاثون ألف و خمس مئة و سبع وأربعون '],
            ['123456789123123876983273829492283504036547284', ' مئة و ثلاث وعشرون تريدشيليون و أربع مئة و ست وخمسون دودشيليون و سبع مئة و تسع وثمانون أوندشيلليون و مئة و ثلاث وعشرون دشيليون و مئة و ثلاث وعشرون نونيلليون و ثمان مئة و ست وسبعون أوكتيليون و تسع مئة و ثلاث وثمانون سبتيلليون و مئتان و ثلاث وسبعون سكستليون و ثمان مئة و تسع وعشرون كوينتليون و أربع مئة و اثنان وتسعون كوادريليون و مئتان و ثلاث وثمانون تريليون و خمس مئة و أربع بليون و ست و ثلاثون مليون و خمس مئة و سبع وأربعون ألف و مئتان و أربع وثمانون '],
            ['123456789123123876983273829492283504036547284436', ' مئة و ثلاث وعشرون كواتوردشيليون و أربع مئة و ست وخمسون تريدشيليون و سبع مئة و تسع وثمانون دودشيليون و مئة و ثلاث وعشرون أوندشيلليون و مئة و ثلاث وعشرون دشيليون و ثمان مئة و ست وسبعون نونيلليون و تسع مئة و ثلاث وثمانون أوكتيليون و مئتان و ثلاث وسبعون سبتيلليون و ثمان مئة و تسع وعشرون سكستليون و أربع مئة و اثنان وتسعون كوينتليون و مئتان و ثلاث وثمانون كوادريليون و خمس مئة و أربع تريليون و ست و ثلاثون بليون و خمس مئة و سبع وأربعون مليون و مئتان و أربع وثمانون ألف و أربع مئة و ست وثلاثون '],
            ['123456789123123876983273829492283504036547284436453', ' مئة و ثلاث وعشرون كويندشيليون و أربع مئة و ست وخمسون كواتوردشيليون و سبع مئة و تسع وثمانون تريدشيليون و مئة و ثلاث وعشرون دودشيليون و مئة و ثلاث وعشرون أوندشيلليون و ثمان مئة و ست وسبعون دشيليون و تسع مئة و ثلاث وثمانون نونيلليون و مئتان و ثلاث وسبعون أوكتيليون و ثمان مئة و تسع وعشرون سبتيلليون و أربع مئة و اثنان وتسعون سكستليون و مئتان و ثلاث وثمانون كوينتليون و خمس مئة و أربع كوادريليون و ست و ثلاثون تريليون و خمس مئة و سبع وأربعون بليون و مئتان و أربع وثمانون مليون و أربع مئة و ست وثلاثون ألف و أربع مئة و ثلاث وخمسون '],
            ['123456789123123876983273829492283504036547284436453435', ' مئة و ثلاث وعشرون سكسدشيليون و أربع مئة و ست وخمسون كويندشيليون و سبع مئة و تسع وثمانون كواتوردشيليون و مئة و ثلاث وعشرون تريدشيليون و مئة و ثلاث وعشرون دودشيليون و ثمان مئة و ست وسبعون أوندشيلليون و تسع مئة و ثلاث وثمانون دشيليون و مئتان و ثلاث وسبعون نونيلليون و ثمان مئة و تسع وعشرون أوكتيليون و أربع مئة و اثنان وتسعون سبتيلليون و مئتان و ثلاث وثمانون سكستليون و خمس مئة و أربع كوينتليون و ست و ثلاثون كوادريليون و خمس مئة و سبع وأربعون تريليون و مئتان و أربع وثمانون بليون و أربع مئة و ست وثلاثون مليون و أربع مئة و ثلاث وخمسون ألف و أربع مئة و خمس وثلاثون '],
            ['123456789123123876983273829492283504036547284436453435786', ' مئة و ثلاث وعشرون سبتندشيليون و أربع مئة و ست وخمسون سكسدشيليون و سبع مئة و تسع وثمانون كويندشيليون و مئة و ثلاث وعشرون كواتوردشيليون و مئة و ثلاث وعشرون تريدشيليون و ثمان مئة و ست وسبعون دودشيليون و تسع مئة و ثلاث وثمانون أوندشيلليون و مئتان و ثلاث وسبعون دشيليون و ثمان مئة و تسع وعشرون نونيلليون و أربع مئة و اثنان وتسعون أوكتيليون و مئتان و ثلاث وثمانون سبتيلليون و خمس مئة و أربع سكستليون و ست و ثلاثون كوينتليون و خمس مئة و سبع وأربعون كوادريليون و مئتان و أربع وثمانون تريليون و أربع مئة و ست وثلاثون بليون و أربع مئة و ثلاث وخمسون مليون و أربع مئة و خمس وثلاثون ألف و سبع مئة و ست وثمانون '],
            ['123456789123123876983273829492283504036547284436453435786172', ' مئة و ثلاث وعشرون أوكتودشيليون و أربع مئة و ست وخمسون سبتندشيليون و سبع مئة و تسع وثمانون سكسدشيليون و مئة و ثلاث وعشرون كويندشيليون و مئة و ثلاث وعشرون كواتوردشيليون و ثمان مئة و ست وسبعون تريدشيليون و تسع مئة و ثلاث وثمانون دودشيليون و مئتان و ثلاث وسبعون أوندشيلليون و ثمان مئة و تسع وعشرون دشيليون و أربع مئة و اثنان وتسعون نونيلليون و مئتان و ثلاث وثمانون أوكتيليون و خمس مئة و أربع سبتيلليون و ست و ثلاثون سكستليون و خمس مئة و سبع وأربعون كوينتليون و مئتان و أربع وثمانون كوادريليون و أربع مئة و ست وثلاثون تريليون و أربع مئة و ثلاث وخمسون بليون و أربع مئة و خمس وثلاثون مليون و سبع مئة و ست وثمانون ألف و مئة و اثنان وسبعون '],
            ['123456789123123876983273829492283504036547284436453435786172182', ' مئة و ثلاث وعشرون نوفمدشيليون و أربع مئة و ست وخمسون أوكتودشيليون و سبع مئة و تسع وثمانون سبتندشيليون و مئة و ثلاث وعشرون سكسدشيليون و مئة و ثلاث وعشرون كويندشيليون و ثمان مئة و ست وسبعون كواتوردشيليون و تسع مئة و ثلاث وثمانون تريدشيليون و مئتان و ثلاث وسبعون دودشيليون و ثمان مئة و تسع وعشرون أوندشيلليون و أربع مئة و اثنان وتسعون دشيليون و مئتان و ثلاث وثمانون نونيلليون و خمس مئة و أربع أوكتيليون و ست و ثلاثون سبتيلليون و خمس مئة و سبع وأربعون سكستليون و مئتان و أربع وثمانون كوينتليون و أربع مئة و ست وثلاثون كوادريليون و أربع مئة و ثلاث وخمسون تريليون و أربع مئة و خمس وثلاثون بليون و سبع مئة و ست وثمانون مليون و مئة و اثنان وسبعون ألف و مئة و اثنان وثمانون '],
            ['123456789123123876983273829492283504036547284436453435786172182194', ' مئة و ثلاث وعشرون فجنتليون و أربع مئة و ست وخمسون نوفمدشيليون و سبع مئة و تسع وثمانون أوكتودشيليون و مئة و ثلاث وعشرون سبتندشيليون و مئة و ثلاث وعشرون سكسدشيليون و ثمان مئة و ست وسبعون كويندشيليون و تسع مئة و ثلاث وثمانون كواتوردشيليون و مئتان و ثلاث وسبعون تريدشيليون و ثمان مئة و تسع وعشرون دودشيليون و أربع مئة و اثنان وتسعون أوندشيلليون و مئتان و ثلاث وثمانون دشيليون و خمس مئة و أربع نونيلليون و ست و ثلاثون أوكتيليون و خمس مئة و سبع وأربعون سبتيلليون و مئتان و أربع وثمانون سكستليون و أربع مئة و ست وثلاثون كوينتليون و أربع مئة و ثلاث وخمسون كوادريليون و أربع مئة و خمس وثلاثون تريليون و سبع مئة و ست وثمانون بليون و مئة و اثنان وسبعون مليون و مئة و اثنان وثمانون ألف و مئة و أربع وتسعون ']
        ]
            .forEach(([number, text]) =>
                it(`Should return the right text equivalent for ${number}`, function () {
                    expect(convert(number).trim()).to.equal(text.trim());
                })
            )
    });

    describe('Failure cases', function () {
        it('Should fail due to not passing any value', function () {
            expect(convert.bind(null)).to.throw();
        });
        it('Should fail due to passing string value', function () {
            expect(convert.bind(null, 'test')).to.throw();
        });
        it('Should fail due to passing boolean value', function () {
            expect(convert.bind(null, true)).to.throw();
        });
        it('Should fail due to passing object value', function () {
            expect(convert.bind(null, { test: true })).to.throw();
        });
    });
});
